app/controllers/equipment_controller.rb

  def index
    @equipment = Equipment.full_load.order("deleted_at, accepted_at, domain_name").page(params[:page])
---
SELECT "equipment".* FROM "equipment" WHERE "equipment"."deleted_at" IS NULL AND ("equipment"."accepted_at" BETWEEN '2012-05-27 19:05:32.581847' AND '2013-05-27 19:05:32.581940') ORDER BY deleted_at, accepted_at, domain_name LIMIT 25 OFFSET 0
SELECT COUNT(*) FROM "equipment" WHERE "equipment"."deleted_at" IS NULL AND ("equipment"."accepted_at" BETWEEN '2012-05-27 19:05:32.581847' AND '2013-05-27 19:05:32.581940')