app/controllers/sessions_controller.rb

UPDATE "users" SET "login_count" = 1, "last_login_at" = '2013-05-27 19:05:32.416517', "updated_at" = '2013-05-27 19:05:32.445504' WHERE "users"."id" = 1
---
  def create
    user = login(params[:login], params[:password], params[:remember_me])
    if user
      user.login_count +=1
      user.last_login_at = Time.now
      user.save