app/controllers/users_controller.rb

SELECT "users".* FROM "users" ORDER BY admin_user DESC, admin_equip DESC, admin_inv DESC, responsible DESC, login LIMIT 25 OFFSET 0
SELECT COUNT(*) FROM "users"
---
  def index


    respond_to do |format|
      format.html {
        @users = User.order("admin_user DESC, admin_equip DESC, admin_inv DESC, responsible DESC", :login).page(params[:page])